### Table: Employee

| Column Name | Type    |
|--------------|---------|
| id           | int     |
| name         | varchar |
| salary       | int     |
| managerId    | int     |

**Description:**
- `id` is the primary key (unique for each employee).  
- Each row shows an employee’s ID, name, salary, and their manager’s ID.

---

### Task
Write a solution to find the **employees who earn more than their managers**.  
Return the result table in any order.

---

### Example 1

**Input:**

#### Employee table
| id | name  | salary | managerId |
|----|--------|---------|-----------|
| 1  | Joe    | 70000   | 3         |
| 2  | Henry  | 80000   | 4         |
| 3  | Sam    | 60000   | NULL      |
| 4  | Max    | 90000   | NULL      |

---

**Output:**

| Employee |
|-----------|
| Joe       |

---

**Explanation:**
- Joe’s manager is Sam (managerId = 3).  
- Joe’s salary (70000) is greater than Sam’s (60000).  
- Therefore, Joe is the only employee who earns more than his manager.

In [6]:
import pandas as pd

In [3]:
employee_data = {
    'id': [1, 2, 3, 4],
    'name': ['Joe', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 80000, 60000, 90000],
    'managerId': [3, 4, None, None]
}

employee_df = pd.DataFrame(employee_data)
employee_df

   id   name  salary  managerId
0   1    Joe   70000        3.0
1   2  Henry   80000        4.0
2   3    Sam   60000        NaN
3   4    Max   90000        NaN

In [4]:
def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    merged = employee.merge(
        employee, 
        left_on='managerId', 
        right_on='id', 
        suffixes=('', '_manager')
    )
    
    result = merged[merged['salary'] > merged['salary_manager']]
    return result[['name']].rename(columns={'name': 'Employee'})

In [5]:
result_df = find_employees(employee_df)
print("Natija (maoshi manageridan katta bo'lgan employeelar):")
result_df

Natija (maoshi manageridan katta bo'lgan employeelar):

  Employee
0      Joe